spec/cassettes/Student_signs_in_while_class_is_not_in_session/after_verifying_their_bank_account/shows_them_their_payment_history.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: description=student97%40example.com
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        epicodus-73.local 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56
        PST 2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"epicodus-73.local"}'
      Content-Length:
      - '35'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 11 Feb 2016 21:12:43 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '871'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7tECqehXqrt4wE
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_7tEC8Hee6257ai",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7tEC8Hee6257ai/bank_accounts"
          },
          "created": 1455225163,
          "currency": null,
          "default_bank_account": null,
          "default_source": null,
          "default_source_type": null,
          "delinquent": false,
          "description": "student97@example.com",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7tEC8Hee6257ai/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7tEC8Hee6257ai/subscriptions"
          }
        }
    http_version: 
  recorded_at: Thu, 11 Feb 2016 21:13:03 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_7tEC8Hee6257ai/sources
    body:
      encoding: UTF-8
      string: source[account_number]=000123456789&source[country]=US&source[object]=bank_account&source[routing_number]=110000000
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        epicodus-73.local 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56
        PST 2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"epicodus-73.local"}'
      Content-Length:
      - '115'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 11 Feb 2016 21:12:44 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '344'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7tECDd6UXcpWnp
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ba_7tECCd0hMBcWqZ",
          "object": "bank_account",
          "account_holder_type": null,
          "bank_name": "STRIPE TEST BANK",
          "country": "US",
          "currency": "usd",
          "customer": "cus_7tEC8Hee6257ai",
          "fingerprint": "qw2YdYDmIJUuNi9w",
          "last4": "6789",
          "metadata": {},
          "name": null,
          "routing_number": "110000000",
          "status": "new"
        }
    http_version: 
  recorded_at: Thu, 11 Feb 2016 21:13:04 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_7tEC8Hee6257ai
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        epicodus-73.local 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56
        PST 2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"epicodus-73.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 11 Feb 2016 21:12:44 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1789'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7tEChO1VTcBFBd
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_7tEC8Hee6257ai",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "data": [
              {
                "id": "ba_7tECCd0hMBcWqZ",
                "object": "bank_account",
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_7tEC8Hee6257ai",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "name": null,
                "routing_number": "110000000",
                "status": "new"
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_7tEC8Hee6257ai/bank_accounts"
          },
          "created": 1455225163,
          "currency": null,
          "default_bank_account": "ba_7tECCd0hMBcWqZ",
          "default_source": "ba_7tECCd0hMBcWqZ",
          "default_source_type": "bank_account",
          "delinquent": false,
          "description": "student97@example.com",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "ba_7tECCd0hMBcWqZ",
                "object": "bank_account",
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_7tEC8Hee6257ai",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "name": null,
                "routing_number": "110000000",
                "status": "new"
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_7tEC8Hee6257ai/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7tEC8Hee6257ai/subscriptions"
          }
        }
    http_version: 
  recorded_at: Thu, 11 Feb 2016 21:13:04 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_7tEC8Hee6257ai/sources/ba_7tECCd0hMBcWqZ
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        epicodus-73.local 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56
        PST 2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"epicodus-73.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 11 Feb 2016 21:12:44 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '344'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7tEC6WaI8byot1
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ba_7tECCd0hMBcWqZ",
          "object": "bank_account",
          "account_holder_type": null,
          "bank_name": "STRIPE TEST BANK",
          "country": "US",
          "currency": "usd",
          "customer": "cus_7tEC8Hee6257ai",
          "fingerprint": "qw2YdYDmIJUuNi9w",
          "last4": "6789",
          "metadata": {},
          "name": null,
          "routing_number": "110000000",
          "status": "new"
        }
    http_version: 
  recorded_at: Thu, 11 Feb 2016 21:13:04 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_7tEC8Hee6257ai
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        epicodus-73.local 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56
        PST 2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"epicodus-73.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 11 Feb 2016 21:12:44 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1789'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7tECoaYfU8tFKn
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_7tEC8Hee6257ai",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "data": [
              {
                "id": "ba_7tECCd0hMBcWqZ",
                "object": "bank_account",
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_7tEC8Hee6257ai",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "name": null,
                "routing_number": "110000000",
                "status": "new"
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_7tEC8Hee6257ai/bank_accounts"
          },
          "created": 1455225163,
          "currency": null,
          "default_bank_account": "ba_7tECCd0hMBcWqZ",
          "default_source": "ba_7tECCd0hMBcWqZ",
          "default_source_type": "bank_account",
          "delinquent": false,
          "description": "student97@example.com",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "ba_7tECCd0hMBcWqZ",
                "object": "bank_account",
                "account_holder_type": null,
                "bank_name": "STRIPE TEST BANK",
                "country": "US",
                "currency": "usd",
                "customer": "cus_7tEC8Hee6257ai",
                "fingerprint": "qw2YdYDmIJUuNi9w",
                "last4": "6789",
                "metadata": {},
                "name": null,
                "routing_number": "110000000",
                "status": "new"
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_7tEC8Hee6257ai/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_7tEC8Hee6257ai/subscriptions"
          }
        }
    http_version: 
  recorded_at: Thu, 11 Feb 2016 21:13:04 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_7tEC8Hee6257ai/sources/ba_7tECCd0hMBcWqZ/verify
    body:
      encoding: UTF-8
      string: amounts[]=32&amounts[]=45
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        epicodus-73.local 15.2.0 Darwin Kernel Version 15.2.0: Fri Nov 13 19:56:56
        PST 2015; root:xnu-3248.20.55~2/RELEASE_X86_64 x86_64","hostname":"epicodus-73.local"}'
      Content-Length:
      - '25'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 11 Feb 2016 21:12:44 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '349'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7tEC9pRJ6lLLXf
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ba_7tECCd0hMBcWqZ",
          "object": "bank_account",
          "account_holder_type": null,
          "bank_name": "STRIPE TEST BANK",
          "country": "US",
          "currency": "usd",
          "customer": "cus_7tEC8Hee6257ai",
          "fingerprint": "qw2YdYDmIJUuNi9w",
          "last4": "6789",
          "metadata": {},
          "name": null,
          "routing_number": "110000000",
          "status": "verified"
        }
    http_version: 
  recorded_at: Thu, 11 Feb 2016 21:13:04 GMT
- request:
    method: post
    uri: https://<HELLO_SIGN_API_KEY>:@api.hellosign.com/v3/signature_request/create_embedded
    body:
      encoding: UTF-8
      string: client_id=<HELLO_SIGN_CLIENT_ID>&file_url%5B%5D=https%3A%2F%2Fwww.dropbox.com%2Fs%2Fkuyegiukdg57sym%2Fcode_of_conduct.pdf%3Fdl%3D1&signers%5B0%5D%5Bemail_address%5D=student97%40example.com&signers%5B0%5D%5Bname%5D=Example+Brown+101&subject=Sign+to+accept+the+Epicodus+Code+of+Conduct&test_mode=1
    headers:
      User-Agent:
      - hellosign-ruby-sdk/3.2.7
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Authorization, Origin, X-Requested-With, Content-Type, Accept
      Access-Control-Allow-Methods:
      - GET, POST, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Feb 2016 21:12:45 GMT
      P3p:
      - CP="NOP3PPOLICY"
      Server:
      - Apache
      User-Agent:
      - HelloSign API
      X-Content-Type-Options:
      - nosniff
      X-Ratelimit-Limit:
      - '50'
      X-Ratelimit-Limit-Remaining:
      - '36'
      X-Ratelimit-Reset:
      - '1455225165'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '1108'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |2-

        {"signature_request":{"signature_request_id":"9b18d022735e19ad60c6c9d3b795dbd9fc007bf4","test_mode":true,"title":"Sign to accept the Epicodus Code of Conduct","original_title":"Sign to accept the Epicodus Code of Conduct","subject":"Sign to accept the Epicodus Code of Conduct","message":null,"metadata":{},"is_complete":false,"has_error":false,"custom_fields":[],"response_data":[],"signing_url":null,"signing_redirect_url":null,"final_copy_uri":"\/v3\/signature_request\/final_copy\/9b18d022735e19ad60c6c9d3b795dbd9fc007bf4","files_url":"https:\/\/api.hellosign.com\/v3\/signature_request\/files\/9b18d022735e19ad60c6c9d3b795dbd9fc007bf4","details_url":"https:\/\/www.hellosign.com\/home\/manage?guid=9b18d022735e19ad60c6c9d3b795dbd9fc007bf4","requester_email_address":"michael@epicodus.com","signatures":[{"signature_id":"4ff02d49bc60dcc3f3fd732358f687e6","has_pin":false,"signer_email_address":"student97@example.com","signer_name":"Example Brown 101","order":null,"status_code":"awaiting_signature","signed_at":null,"last_viewed_at":null,"last_reminded_at":null,"error":null}],"cc_email_addresses":[]}}
    http_version: 
  recorded_at: Thu, 11 Feb 2016 21:13:06 GMT
- request:
    method: get
    uri: https://<HELLO_SIGN_API_KEY>:@api.hellosign.com/v3/embedded/sign_url/4ff02d49bc60dcc3f3fd732358f687e6
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - hellosign-ruby-sdk/3.2.7
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Access-Control-Allow-Headers:
      - Authorization, Origin, X-Requested-With, Content-Type, Accept
      Access-Control-Allow-Methods:
      - GET, POST, OPTIONS
      Access-Control-Allow-Origin:
      - "*"
      Content-Type:
      - application/json
      Date:
      - Thu, 11 Feb 2016 21:12:46 GMT
      P3p:
      - CP="NOP3PPOLICY"
      Server:
      - Apache
      User-Agent:
      - HelloSign API
      X-Content-Type-Options:
      - nosniff
      X-Ratelimit-Limit:
      - '500'
      X-Ratelimit-Limit-Remaining:
      - '496'
      X-Ratelimit-Reset:
      - '1455225166'
      X-Xss-Protection:
      - 1; mode=block
      Content-Length:
      - '187'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |2-

        {"embedded":{"sign_url":"https:\/\/www.hellosign.com\/editor\/embeddedSign?signature_id=4ff02d49bc60dcc3f3fd732358f687e6&token=db903059d4cbc2f5ac96a37ba92dc1ce","expires_at":1455228766}}
    http_version: 
  recorded_at: Thu, 11 Feb 2016 21:13:06 GMT
recorded_with: VCR 3.0.1
